andrew-2.3.1/run/tutorials/compressible/sonicFoam/ras/prism/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0)
    (24 0 0)
    (31 0 0)
    (100 0 0)
    (0 0.8 0)
    (24 0.8 0)
    (31 0.8 0)
    (100 0.8 0)
    (0 6 0)
    (27 6 0)
    (31 4 0)
    (100 4 0)
    (31 8 0)
    (100 8 0)
    (0 11.2 0)
    (24 11.2 0)
    (31 11.2 0)
    (100 11.2 0)
    (0 12 0)
    (24 12 0)
    (31 12 0)
    (100 12 0)
    (0 0 8)
    (24 0 8)
    (31 0 8)
    (100 0 8)
    (0 0.8 8)
    (24 0.8 8)
    (31 0.8 8)
    (100 0.8 8)
    (0 6 8)
    (27 6 8)
    (31 4 8)
    (100 4 8)
    (31 8 8)
    (100 8 8)
    (0 11.2 8)
    (24 11.2 8)
    (31 11.2 8)
    (100 11.2 8)
    (0 12 8)
    (24 12 8)
    (31 12 8)
    (100 12 8)
);

blocks
(
    hex (0 1 5 4 22 23 27 26) (16 8 1) simpleGrading (0.0526 5.3637 1)
    hex (4 5 9 8 26 27 31 30) (16 16 1) simpleGrading (0.0526 1 1)
    hex (5 6 10 9 27 28 32 31) (16 16 1) simpleGrading (1 1 1)
    hex (1 2 6 5 23 24 28 27) (16 8 1) simpleGrading (1 5.3637 1)
    hex (2 3 7 6 24 25 29 28) (75 8 1) simpleGrading (7 5.3637 1)
    hex (6 7 11 10 28 29 33 32) (75 16 1) simpleGrading (7 1 1)
    hex (10 11 13 12 32 33 35 34) (75 20 1) simpleGrading (7 1 1)
    hex (12 13 17 16 34 35 39 38) (75 16 1) simpleGrading (7 1 1)
    hex (16 17 21 20 38 39 43 42) (75 8 1) simpleGrading (7 0.1864 1)
    hex (15 16 20 19 37 38 42 41) (16 8 1) simpleGrading (1 0.1864 1)
    hex (9 12 16 15 31 34 38 37) (16 16 1) simpleGrading (1 1 1)
    hex (8 9 15 14 30 31 37 36) (16 16 1) simpleGrading (0.0526 1 1)
    hex (14 15 19 18 36 37 41 40) (16 8 1) simpleGrading (0.0526 0.1864 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 22 26 4)
            (4 26 30 8)
            (8 30 36 14)
            (14 36 40 18)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 29 25)
            (7 11 33 29)
            (11 13 35 33)
            (13 17 39 35)
            (17 21 43 39)
        );
    }
    bottomWall
    {
        type patch;
        faces
        (
            (0 1 23 22)
            (1 2 24 23)
            (2 3 25 24)
        );
    }
    topWall
    {
        type patch;
        faces
        (
            (18 40 41 19)
            (19 41 42 20)
            (20 42 43 21)
        );
    }
    prismWall
    {
        type wall;
        faces
        (
            (12 10 32 34)
            (12 34 31 9)
            (9 31 32 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
